In [1]:
import pandas as pd
import matplotlib.pyplot as plt
import numpy as np

In [9]:
df = pd.DataFrame([[1,2,np.nan,0,5],
                  [4,5,6,8,7],
                  [8,9,np.nan,7,5],
                  [1,4,np.nan,3,6]],
                  columns = list("ABCDE"))

In [10]:
df1 = pd.DataFrame([[np.nan,1,8,9,np.nan],
                   [4,5,8,np.nan,3],
                   [1,2,5,4,np.nan],
                   [7,5,8,6,8],
                   [np.nan,8,2,np.nan,5]],
                  columns = list("ABCDE"))

In [11]:
df

   A  B    C  D  E
0  1  2  NaN  0  5
1  4  5  6.0  8  7
2  8  9  NaN  7  5
3  1  4  NaN  3  6

In [12]:
df1

     A  B  C    D    E
0  NaN  1  8  9.0  NaN
1  4.0  5  8  NaN  3.0
2  1.0  2  5  4.0  NaN
3  7.0  5  8  6.0  8.0
4  NaN  8  2  NaN  5.0

In [13]:
df.mean()

A    3.50
B    5.00
C    6.00
D    4.50
E    5.75
dtype: float64

In [14]:
df1.mean()

A    4.000000
B    4.200000
C    6.200000
D    6.333333
E    5.333333
dtype: float64

In [15]:
df1.fillna(df1.mean())

     A  B  C         D         E
0  4.0  1  8  9.000000  5.333333
1  4.0  5  8  6.333333  3.000000
2  1.0  2  5  4.000000  5.333333
3  7.0  5  8  6.000000  8.000000
4  4.0  8  2  6.333333  5.000000

In [16]:
df.fillna(df.mean())

   A  B    C  D  E
0  1  2  6.0  0  5
1  4  5  6.0  8  7
2  8  9  6.0  7  5
3  1  4  6.0  3  6

In [17]:
# Other method to fill values same as